# Setup
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'git'
brew 'openssl'
brew 'pkg-config'
brew 'mas'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'node-build'
brew 'nodenv'
brew 'mint'
brew 'swiftgen'
brew 'swiftformat'
brew 'z'
brew 'git-lfs'
brew 'carthage'
brew 'ffmpeg'
brew 'imagemagick'
brew 'gh'

brew 'robotsandpencils/made/xcodes'

cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'
cask 'sketch'
cask 'figma'
cask 'iterm2'
cask 'macdown'
cask 'font-fira-code'
cask 'vlc'
cask 'spotify'
cask 'visual-studio-code'
cask 'sourcetree'
cask '1password-cli'
cask 'zoom'
cask 'tuxera-ntfs'
cask 'toggl-track'
cask 'discord'
cask 'telegram'
cask 'signal'
cask 'iina'
cask 'slack'
cask 'discord'

mas '1Password', id: 1333542190
mas 'The Unarchiver', id: 425424353
mas 'Boop', id: 1518425043
mas 'Apple Developer', id: 640199958
mas 'Affinity Photo', id: 824183456
mas 'Affinity Designer', id: 824171161
