# Setup
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'robotsandpencils/made'

brew 'git'
brew 'git-lfs'

brew 'openssl'
brew 'pkg-config'

brew 'imagemagick'
brew 'ffmpeg'

brew 'rbenv'
brew 'nodenv'
brew 'pyenv'

brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'node-build'

brew 'mint'

brew 'z'
brew 'fzy'

brew 'gh'
brew 'aria2'

brew 'xcodes'
brew 'mas'

# Casks
cask 'tuxera-ntfs'
cask 'the-unarchiver'

cask 'font-fira-code'

cask '1password'

cask 'firefox'
cask 'google-chrome'

cask 'fork'
cask 'visual-studio-code'

cask 'iterm2'
cask 'macdown'

cask 'vlc'
cask 'iina'

cask 'telegram'
cask 'signal'
cask 'slack'
cask 'discord'
cask 'zoom'

cask 'affinity-photo'
cask 'affinity-designer'
cask 'sketch'
cask 'figma'

cask 'devtoys'
