# Setup
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'git'
brew 'openssl'
brew 'pkg-config'
brew 'mas'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'node-build'
brew 'nodenv'
brew 'go'

cask 'atom'
cask 'java'
cask 'flux'
cask 'google-chrome'
cask 'firefox'
cask 'android-studio'
cask 'sizeup'
cask 'steam'
cask 'textmate'
cask 'vagrant'
cask 'sketch'
cask 'iterm2'
cask 'macdown'
cask 'virtualbox'
cask 'vyprvpn'
cask 'font-inconsolata'
cask 'vlc'
cask 'spotify'
cask 'dropbox'

mas 'Xcode (8.0)', id: 497799835
mas 'Keynote (7.0)', id: 409183694
mas 'Mactracker (7.5.6)', id: 430255202
mas 'Slack (2.0.3)', id: 803453959
mas 'Pages (6.0)', id: 409201541
mas 'Numbers (4.0)', id: 409203825
mas 'Affinity Designer (1.5.1)', id: 824171161
mas 'Affinity Photo (1.4.3)', id: 824183456
mas 'Byword (2.7)', id: 420212497
mas 'Tweetbot (2.4.4)', id: 557168941
