nick-rudenko.back-n-forth
hookyqr.beautify
michelemelluso.code-beautifier
editorconfig.editorconfig
dbaeumer.vscode-eslint
eamodio.gitlens
orta.vscode-ios-common-files
eriklynd.json-tools
pkief.material-icon-theme
whizkydee.material-palenight-theme
esbenp.prettier-vscode
tyriar.sort-lines
unional.vscode-sort-package-json
togusa09.tmlanguage
ms-vscode.vscode-typescript-tslint-plugin
travisthetechie.write-good-linter
ban.spellright
